Revit 2027 API
DirectShapeTypeOptions Constructor
 Constructs a new DirectShapeTypeOptions instance with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeTypeOptions()
Public Sub New
public:
DirectShapeTypeOptions()
new : unit -> DirectShapeTypeOptions
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace